[
  {
    "type": "title",
    "content": "Imprison"
  },
  {
    "type": "image",
    "src": "/decks/rs-pk/imprison/cover.jpg"
  },
  {
    "type": "imageCaption",
    "content": "An unlikely band of heroes…"
  },
  {
    "type": "heading",
    "content": "Concept"
  },
  {
    "type": "paragraph",
    "content": "Its no secret that every Gardevoir card must have a deck built around it. This one is no exception."
  },
  {
    "type": "paragraph",
    "content": "Imprison is a powerful deck that denies the opponent Poke-Powers and Poke-Bodies, whilst moving energy around the board to craft the perfect play each turn. Both Gardevoir (ex δ & just δ) move energy around the board, which makes the Imprison deck very resilient to KOs and able to use some neat tricks to power up Pokemon in one turn. "
  },
  {
    "type": "paragraph",
    "content": "Get Holon’s Castform attached to your Pokemon and keep them on the board, making impactful plays with Pidgeot’s “Quick Search” and strangling out your opponent’s Pokemon with Gardevoir ex δ’s “Imprison” Poke-Power. "
  },
  {
    "type": "image",
    "src": "/decks/rs-pk/imprison/quickSearch.jpg"
  },
  {
    "type": "imageCaption",
    "content": "Pidgeot’s Poke-Power"
  },
  {
    "type": "paragraph",
    "content": "There’s two main schools of thought in modern RS-PK Imprison lists: Japanese (slower with infinite resource loops) and American (more consistent and aggressive). This list is an American one. "
  },
  {
    "type": "heading",
    "content": "Things to watch out for"
  },
  {
    "type": "paragraph",
    "content": "Both Gardevoir in the deck have Psychic weakness, so watch out when playing against Banette ex and Flygon ex δ. Both are susceptible to Sceptile ex δ shutting down their attacks, and using Regirock ex to tank early. Mew Star δ is a good attacker into Banette, once you have 6 Supporter cards in the discard it OHKOs Banette ex. "
  },
  {
    "type": "paragraph",
    "content": "Jirachi ex can be a real thorn in the decks side, try to establish a Sceptile ex δ, wall it with Regirock ex or just punch through it with a Gardevoir ex δ and accept the 2 lost prizes - the second Jirachi trades much worse than the first."
  },
  {
    "type": "paragraph",
    "content": "Lunatone + Solrock shuts off “Quick Search” but you can neutralise Solrock with an “Imprison” or force it off the board with Giant Stump."
  },
  {
    "type": "heading",
    "content": "The Deck"
  },
  {
    "type": "image",
    "src": "/decks/rs-pk/imprison/decklist.jpg"
  },
  {
    "type": "link",
    "href": "my.limitlesstcg.com/builder?i=10222DF610222DF600222DF330222DF930221DS60322HP440222HP770422RG100122CG680122CG960123DF1010121DX90122HL980122DS700332TRR860222DS930122DS970122SS870122DS950122HP850422DS980422CG850422HP900122MA850132TRR840132TRR850122LM750322HP980323UF1000223EM1050122UF990122RS94",
    "content": "Decklist on LimitlessTCG"
  },
  {
    "type": "heading",
    "content": "Core Pokemon"
  },
  {
    "type": "subheading",
    "content": "(2-2)-2-(2-2) Ralts, Kirlia, Gardevoir δ & Gardevoir ex δ"
  },
  {
    "type": "paragraph",
    "content": "You don’t need an overwhelming amount of Ralts on the board early, two is often enough. “Psychic Boom” and “Hypnosis” are both relevant attacks on the Psychic Ralts, whereas Ralts δ aids Castform draws. Save Rare Candy where possible with Kirlia, it is better at times to have a Kirlia on board than pre-emptively evolving to either Gardevoir and finding out after that you need the other Gardevoir."
  },
  {
    "type": "image",
    "src": "/decks/rs-pk/imprison/gardevoirs.jpg"
  },
  {
    "type": "paragraph",
    "content": "Gardevoir δ really pulls the deck together in the mid-late game with “Energy Jump” and it has two relevant attacks! Move Energy to relevant attackers and break stalemates with “Psychic Rage”. Try to plan around the knowledge that each “Energy Jump” can only be used once per turn."
  },
  {
    "type": "paragraph",
    "content": "Gardevoir ex δ is a brilliant attacker, at times a tank and always a problem card for your opponent. “Imprison” is best used if you can keep using it turn after turn, shutting off opposing Pidgeots and then playing Rocket’s Admin can win games. Take care against decks playing Crystal Beach, as moving an energy with “Flame Ball” could leave you unable to attack if the stadium comes into play."
  },
  {
    "type": "subheading",
    "content": "2-0-4 Pidgey, Pidgeot"
  },
  {
    "type": "paragraph",
    "content": "Pidgeot cannot be searched by any card in the deck, so 4 copies helps you find that first one to evolve into. From there extra copies can be used as discard fodder for Holon Supporters. Try to do any “uknown” effects (drawing cards with Supporters or using Jirachi’s “Wishing Star”) before using “Quick Search”, incase you find any pieces you may have wanted to search for."
  },
  {
    "type": "subheading",
    "content": "3 Holon’s Castform"
  },
  {
    "type": "paragraph",
    "content": "Holons Castform is a double rainbow Energy, when attached to a Pokemon instead of played onto the bench. Getting multiple Castforms in play is critical to the deck, and gives you multiple uses of Energy with effects such as Warp or Cyclone Energy."
  },
  {
    "type": "paragraph",
    "content": "Castform can also be used to set up if opened, “Delta Draw” can be a good option in early turns."
  },
  {
    "type": "subheading",
    "content": "1 Holon’s Magnemite"
  },
  {
    "type": "paragraph",
    "content": "Magnemite is attachable as one Colourless Energy, similar to Castform it is searchable with Pokemon search, which makes it super useful for retreating to Jirachi, attaching to Castform or just getting that attachment for turn down in the early turns."
  },
  {
    "type": "subheading",
    "content": "1 Jirachi"
  },
  {
    "type": "paragraph",
    "content": "Jirachi is the real optimal opener, and quite often you will find yourself wanting to play a Holon Mentor to search out Jirachi and use “Wishing Star” to fish the top of the deck looking for pieces that might put Rare Candy + Pidgeot together."
  },
  {
    "type": "image",
    "src": "/decks/rs-pk/imprison/jirachi.jpg"
  },
  {
    "type": "imageCaption",
    "content": "Switch effects such as Warp Point and Warp Energy can be used to get extra uses out of Jirachi in the midgame"
  },
  {
    "type": "heading",
    "content": "Tech Pokemon"
  },
  {
    "type": "subheading",
    "content": "1-0-1 Treecko, Sceptile ex δ"
  },
  {
    "type": "paragraph",
    "content": "Sceptile ex has a number of use cases in Imprison, but it primarily hinders decks that use either Electrode ex or Psychic type Pokemon-ex to attack. The former want to use Electrode’s Poke-Power early, so playing Sceptile ex down ASAP will restrict their gameplan."
  },
  {
    "type": "paragraph",
    "content": "Imprison finds it difficult at times to answer Psychic decks like Banette ex or Flygon ex δ hitting Gardevoir for weakness, but making their attacks cost [C] more can make the difference in slowing them down."
  },
  {
    "type": "paragraph",
    "content": "Against Pidgeot decks you may want to “Imprison” their Pidgeot and then Rare Candy Sceptile into play, shutting down both Pidgeot AND their Pokemon-ex in one turn."
  },
  {
    "type": "paragraph",
    "content": "Sceptile ex δ’s attack “Power Revenge” is nothing to scoff at! It can really ramp up in the lategame, just note that “Extra Liquid” applies to Sceptile itself; the attack costs [P][C][C] in practice."
  },
  {
    "type": "subheading",
    "content": "Mew Star δ"
  },
  {
    "type": "paragraph",
    "content": "Mew Star pushes this deck over the edge against control decks, spamming “Mimicry” to copy the attacks of Stantler, Rayquaza and Raticate puts immense pressure on those decks. Try to keep your Pokemon Retriever safe to recover Mew when it goes down in those matchups. "
  },
  {
    "type": "paragraph",
    "content": "Mew Star can also be used in odd ways such as copying “Clutch” against Pidgeot, copying “Spinning Tail” against Dark Tyranitar and copying “Shadow Chant” against Banette ex!"
  },
  {
    "type": "subheading",
    "content": "Regirock ex"
  },
  {
    "type": "paragraph",
    "content": "Regirock has one job. KO Dark Tyranitar. Place it on the bench and the BombTar player will have to respect it, even with no energy attached. Let them take the lead in the lategame and use Pow! Hand Extension to move the pesky weakness-preventing Holon FF energy off the Tyranitar so that Regirock can go in for the OHKO."
  },
  {
    "type": "image",
    "src": "/decks/rs-pk/imprison/techs.jpg"
  },
  {
    "type": "imageCaption",
    "content": "One of these three will show up in every match"
  },
  {
    "type": "heading",
    "content": "Trainers"
  },
  {
    "type": "subheading",
    "content": "Holon Engine & Setup"
  },
  {
    "type": "paragraph",
    "content": "The deck needs a few key Basic Pokemon on board early, so a combination of 4 Holon’s Transceiver, 2 Holon Mentor and 1 Lanette’s Net Search is seven outs to getting Pokemon on board turn one. "
  },
  {
    "type": "paragraph",
    "content": "Often if your hand has a Warp Energy it’s good to get Jirachi, Ralts & Pidgey to try and find Rare Candy + Pidgeot ASAP. You can always grab Holon’s Magnemite to retreat if you need to get into Jirachi but have very little energy in hand. Missing early attachments is often devastating to Imprison, so try to have atleast one of Holon’s Magnemite or Castform alongside another energy card in hand."
  },
  {
    "type": "image",
    "src": "/decks/rs-pk/imprison/mentor.jpg"
  },
  {
    "type": "imageCaption",
    "content": "If you can, get the three on the left with your first Mentor, and look to set up more Ralts and Castform with your second Mentor"
  },
  {
    "type": "paragraph",
    "content": "Further Transceivers can be used on Holon Researcher to search Kirlias and Gardevoirs, or on Holon Adventurer and Holon Scientist for additional draw."
  },
  {
    "type": "paragraph",
    "content": "The deck also plays 4 Rare Candy to get Pidgeot, Gardevoir and Sceptile into play instantly."
  },
  {
    "type": "subheading",
    "content": "Disruption & Recovery"
  },
  {
    "type": "paragraph",
    "content": "4 Windstorm are practically required, and exist to remove pesky Cessation Crystals, Crystal Beach and Cursed Stone. Having maximum copies gives us maximum outs vs Stantler decks."
  },
  {
    "type": "paragraph",
    "content": "3 Rocket’s Admin is pretty standard, as the deck can use “Quick Search” having hand disruption is a strong option. Combined with “Imprison” a Rocket’s Admin can totally stop an opponents gameplan."
  },
  {
    "type": "paragraph",
    "content": "1 Warp Point can be used as an extra switch in combination with Jirachi or Pidgeot, or to take a cheap prize off the bench. Having Warp Point even as just a way to move Gardevoir without using any Energy is super useful."
  },
  {
    "type": "paragraph",
    "content": "1 Giant Stump allows you to discard damaged Pokemon-ex, or more commonly, force an opponent to discard Pokemon so that you can further lock down their board."
  },
  {
    "type": "paragraph",
    "content": "1 Pow! Hand Extension is a really important card, to gust up a Pokemon in a critical moment and take a KO. Imprison + Pow! + Admin and watch your opponents joy turn to dust. It can also remove Holon FF + Fire combo from Dark Tyranitar, activating its weakness again."
  },
  {
    "type": "heading",
    "content": "Energy"
  },
  {
    "type": "paragraph",
    "content": "The deck plays 10 Energy Cards in addition to 3 Holon’s Castform and 1 Holon’s Magnemite. "
  },
  {
    "type": "paragraph",
    "content": "3 Warp Energy is strong when reused with Castform, enabling Energy jump and untrapping your active Pokemon. "
  },
  {
    "type": "paragraph",
    "content": "3 δ Rainbow Energy can be used as a Rainbow Energy for most attackers in the deck, allowing you to announce attacks without needing Castform in play."
  },
  {
    "type": "paragraph",
    "content": "2 Basic Psychic Energy is mainly in the deck to use Ralts’ “Psychic Boom” which can deal serious damage in specific matchups."
  },
  {
    "type": "paragraph",
    "content": "1 Metal Energy helps Gardevoir δ survive specific damage breakpoints and avoid chip damage, it can be instrumental in baiting a hit to use “Psychic Rage”."
  },
  {
    "type": "paragraph",
    "content": "1 Cyclone Energy is also insanely strong with Castform, moving your opponents active Pokemon when attached to your active Pokemon can allow you to avoid attacking low-priority targets."
  }
]
