[
  {
    "type": "title",
    "content": "RayLer"
  },
  {
    "type": "image",
    "src": "/decks/rs-pk/rayler/cover.jpg"
  },
  {
    "type": "imageCaption",
    "content": "Stupid. Deer."
  },
  {
    "type": "heading",
    "content": "Concept"
  },
  {
    "type": "paragraph",
    "content": "RS-PK as a format allows all of the strong disruption cards of the ex era to exist in one place. Somehow rising to the top as the premier abuser of these cards, this inconspicuous Stantler chips away at opponents resources until Rayquaza can swoop in and clear the field. The only thing more scary than a good RayLer player is trying to learn to pilot the deck, the cards themselves are quite simple but the whole is tough to grasp!"
  },
  {
    "type": "heading",
    "content": "Things to watch out for"
  },
  {
    "type": "paragraph",
    "content": "Sometimes RayLer can be a bit slow to get going, take care that you find your additional basic Pokemon fast enough to not get donked off the board. It also has issues with Copy attackers, if you suspect your opponent plays Mew Star δ be conscious of what you play to the bench."
  },
  {
    "type": "heading",
    "content": "The Deck"
  },
  {
    "type": "image",
    "src": "/decks/rs-pk/rayler/decklist.jpg"
  },
  {
    "type": "link",
    "href": "my.limitlesstcg.com/builder?i=10422UF320322DF970122DX410122LM420432TRR860422CG720322UF860122PK810122EM790123E21300122EM770422RS800432TRR850422RG990123RG1000422CG740122DX840222CG750222LM720e23EM104",
    "content": "Decklist on LimitlessTCG"
  },
  {
    "type": "heading",
    "content": "Pokemon"
  },
  {
    "type": "subheading",
    "content": "4 Stantler"
  },
  {
    "type": "paragraph",
    "content": "When you play this deck, you are going to announce “Push Away” over and over and over. Continuously stripping your opponent’s hand of good cards whilst you attach energy and put small damage on the board makes life dreadful for your opponent. You’ll want to “Push Away” with atleast one Stantler until it dies so that you can use Pow! Hand Extension, or until you can see an opportune moment for you to strike with Rayquaza."
  },
  {
    "type": "paragraph",
    "content": "Stantler has another relevant attack in “Screechy Voice” which is brutal for Evolution Pokemon to deal with. Force them to risk certain doom flipping tails on confusion, or lose resources trying to stabilise."
  },
  {
    "type": "image",
    "src": "/decks/rs-pk/rayler/stantler.jpg"
  },
  {
    "type": "imageCaption",
    "content": "Stantler should look like this on turn 2"
  },
  {
    "type": "subheading",
    "content": "3 Rayquaza ex δ"
  },
  {
    "type": "paragraph",
    "content": "Once your opponent has bricked, or just on turn 2 if you happen to open with it, its time to run them over with Rayquaza ex δ. This powerhouse does an effective 50 snipe for ONE ENERGY or 70 Active for two as you will almost always have “Rage Aura” on when attacking with Rayquaza. When using Stantler try to prep damage for “Special Circuit” and try to use Pow! Hand Extension to push energy onto a weak Pokemon, KOing it with said attack. Balloon Berry is in the deck for retreating a Rayquaza ex without losing any attached Energy, but can also be used to move a Rayquaza you opened inopportunely."
  },
  {
    "type": "subheading",
    "content": "1 Minun"
  },
  {
    "type": "paragraph",
    "content": "Minun’s attack “Sniff Out” lets you threaten that opponent draw passing in a different way: resource looping. Pick up Cessation Crystals, Energy Removals, VS Seeker to put time pressure on them to do something, pulling them into a trap of disruption."
  },
  {
    "type": "subheading",
    "content": "1 Roselia"
  },
  {
    "type": "paragraph",
    "content": "The Roselia has uses against decks like BombTar, pulling up a Pokemon your opponent wants to keep for later and threatening that it will slowly tick to death, lest they do something. Try to grab Pokemon with 2 or more retreat with “Flick Poison”."
  },
  {
    "type": "heading",
    "content": "Trainers"
  },
  {
    "type": "subheading",
    "content": "Castaway Engine & Setup"
  },
  {
    "type": "paragraph",
    "content": "The Supporter card Castaway, which the deck plays 4 of, is the main engine by which you find your Supporter for next turn, an energy attachment and critically a Cessation Crystal. An early Castaway for one of either Pokemon Fan Club or Lanette’s Net Search can get you enough Pokemon on board to play most of the game, from which point using Castaway to search more Cessation Crystals and Rocket’s Admin becomes the main focus. Likewise an early Castaway for Scott will fill your opening hand with playable cards, though it delays your backup Pokemon for two turns."
  },
  {
    "type": "image",
    "src": "/decks/rs-pk/rayler/castaway.jpg"
  },
  {
    "type": "imageCaption",
    "content": "Castaway for… Castaway!"
  },
  {
    "type": "paragraph",
    "content": "Try to get two Stantler on board early. Benching Rayquaza ex early or late depends on what deck you are playing against, but you generally don’t want to bench it if you won’t have issues finding one later and it would be at risk of being attacked."
  },
  {
    "type": "paragraph",
    "content": "The deck plays 3 Mary’s Request which can be used in the midgame to keep drawing and accumulating resources, but is also a nice burst of draw in the late game."
  },
  {
    "type": "subheading",
    "content": "Disruption, Disruption, Disruption"
  },
  {
    "type": "paragraph",
    "content": "This deck plays heavily into disruption, both denying KOs and creating nuisances that force KOs. Put your opponent into positions where they can just about stop the Stantler army, but have nought left to deal with Rayquaza ex."
  },
  {
    "type": "image",
    "src": "/decks/rs-pk/rayler/disruption.jpg"
  },
  {
    "type": "imageCaption",
    "content": "Cards to ruin someone’s day"
  },
  {
    "type": "paragraph",
    "content": "4 Rocket’s Admin for a disruption heavy deck, brick your opponent late and refresh their hand full of goodies to discard early."
  },
  {
    "type": "paragraph",
    "content": "4 Pow! Hand Extension either brings up a Pokemon to the Active spot or moves an Energy off the Pokemon already in the Active spot to a Pokemon of your choosing. Move energy around to trap Pokemon, put energy on useless Pokemon and put your opponent’s threats at a safe distance. Move Scramble and Double Rainbow Energy to basic Pokemon to discard them."
  },
  {
    "type": "paragraph",
    "content": "4 Energy Removal 2 function well in in tandem with Pow! Hand Extension, look to remove Holon’s Castform for double the damage."
  },
  {
    "type": "paragraph",
    "content": "4 Cessation Crystal prevent all Pokemon from using Poke-Powers and Poke-Bodies, so long as the Pokemon with Cessation Crystal is in the Active spot. It slows down the opponent, and limits their plays and, especially when paired with a good Rocket’s Admin, can totally brick your opponent whilst you whittle all their Pokemon down with Push Away. Try not to attach multiple Cessation Crystal at once for fear of Windstorm discarding them all. Remember, this card cannot be attached to Rayquaza ex."
  },
  {
    "type": "paragraph",
    "content": "4 Super Scoop Up allows you to reset a Pokemon entirely, buying time and HP. Use on a damaged Rayquaza or Stantler to nullify an opponent’s attack and preserve resources."
  },
  {
    "type": "paragraph",
    "content": "2 Cursed Stone do 10 damage to each Pokemon with a Poke-Power, between turns. In addition to effectively being +10 damage in a pinch, Cursed Stone can add up! Try to play them after your opponent has played most of their Windstorms to stick it in play for longer."
  },
  {
    "type": "paragraph",
    "content": "2 Crystal Beach deny your opponent access to Holon’s Castform, Double Rainbow Energy and Scramble Energy. This stadium can prevent your opponent from attacking at key moments, and can be used therefore to bait Windstorms early or lock them out late."
  },
  {
    "type": "subheading",
    "content": "Recovery"
  },
  {
    "type": "paragraph",
    "content": "Alongside Minun, the deck plays 1 VS Seeker to reuse a Supporter card in a pinch and 1 Stone’s Project to recycle Energy late game."
  },
  {
    "type": "heading",
    "content": "Energy"
  },
  {
    "type": "paragraph",
    "content": "The deck plays 14 basic Lightning Energy. At this number you have plenty to attach for turn, every turn. It can be important to get manual attachments down on Rayquaza if you intend on taking a prize lead, as you'll need 4 Energy to use Sky-High Claws."
  }
]
