[
  {
    "type": "title",
    "content": "Night March"
  },
  {
    "type": "image",
    "src": "/decks/xy-sts/nightmarch/cover.jpg"
  },
  {
    "type": "imageCaption",
    "content": "NIGHTMARE NIGHTMARE NIGHTMARE"
  },
  {
    "type": "heading",
    "content": "Concept"
  },
  {
    "type": "paragraph",
    "content": "The XY series was defined by insane item cards allowing players to turbo through their decks at a pace not seen elsewhere. The Night March deck leverages this speed and consistency to fuel massive attacks from tiny Pokemon, consistently trading up with Single Prize Pokemon that can easily OHKO Pokemon EX."
  },
  {
    "type": "heading",
    "content": "Things to watch out for"
  },
  {
    "type": "paragraph",
    "content": "Playing Night March is a resource management game, try to keep aware of how many Night Marchers how Puzzle of Time you have remaining, to close out games when hand disruption is played. Also take care to actively choose your attacker! Mew cannot copy attacks whilst you are Ability locked, Pumpkaboo cannot attack without Dimension Valley in play and Joltik gets KOed easily by spread damage."
  },
  {
    "type": "heading",
    "content": "The Deck"
  },
  {
    "type": "image",
    "src": "/decks/xy-sts/nightmarch/decklist.jpg"
  },
  {
    "type": "link",
    "href": "https://limitlesstcg.com/decks/list/1295",
    "content": "Decklist on LimitlessTCG"
  },
  {
    "type": "paragraph",
    "content": "List credit goes to Brad Curcio at Worlds 2016."
  },
  {
    "type": "heading",
    "content": "Night March Pokemon"
  },
  {
    "type": "paragraph",
    "content": "All of the following Pokemon have the “Night March” attack, which does 20 Damage for each Pokemon with  the “Night March” attack in your discard pile. Getting most of these in the discard as soon as possible is how the deck executes on its main strategy, but there are still decisions about which attacker to use when."
  },
  {
    "type": "subheading",
    "content": "4 Joltik"
  },
  {
    "type": "paragraph",
    "content": "Joltik attacks for just a Double Colorless Energy, with no other requirements. It hits for Lightning-Type Damage, which can be useful for taking cheap prizes on opposing Shaymin EX and Yveltal EX when you have a middling set up. Just be careful playing down too many Joltik against Greninja BREAK or other spread-heavy matchups, as it only has 30HP."
  },
  {
    "type": "subheading",
    "content": "4 Pumpkaboo"
  },
  {
    "type": "paragraph",
    "content": "Pumpkaboo's Psychic typing is great for picking up KOs on Hoopa EX, but it requires a Dimension Valley in play to attack. It's 60HP can be boosted to a reasonable 100 with Fighting Fury Belt, which impedes the progress of spread decks."
  },
  {
    "type": "subheading",
    "content": "4 Lampent"
  },
  {
    "type": "paragraph",
    "content": "The deck doesn't play any Litwick, just get these Lampent in the discard for +80 Damage on “Night March”."
  },
  {
    "type": "image",
    "src": "/decks/xy-sts/nightmarch/nightmarchers.jpg"
  },
  {
    "type": "imageCaption",
    "content": "These guys get the job done"
  },
  {
    "type": "heading",
    "content": "Support Pokemon"
  },
  {
    "type": "subheading",
    "content": "3 Shaymin EX"
  },
  {
    "type": "paragraph",
    "content": "Shaymin EX takes a fast deck and makes it faster. Play down your hand, “Set Up” to refill it, and play down your hand again. The heavy count of 3 allows you to dig for pieces early and late, and if they get brought up by Lysandre it means that your attacker didn't get KOed. Shaymin can be removed off the board with AZ and it's attack “Sky Return” for either an extra useage or to prevent your opponent KOing it to win."
  },
  {
    "type": "paragraph",
    "content": "Playing Shaymin down against EX-focused decks when you are looking to take the first attack (going ahead 4-6) is the most comfortable time to play Shaymin, but don't be afraid to play it down to draw two or three when in a pinch."
  },
  {
    "type": "image",
    "src": "/decks/xy-sts/nightmarch/setup.jpg"
  },
  {
    "type": "imageCaption",
    "content": "Shaymin EX's “Set Up” Ability"
  },
  {
    "type": "subheading",
    "content": "2 Mew"
  },
  {
    "type": "paragraph",
    "content": "Mew is an honourary Night Marcher. It's “Memories of Dawn” Ability allows it to use the attacks of other Basic Pokemon in play, notably allowing it to use “Night March”. Attacking with Mew allows you to preserve your Joltik and Pumpkaboo, whilst also having a free retreat pivot. Note that Mew cannot copy “Night March” when Hex Maniac has been played."
  },
  {
    "type": "heading",
    "content": "Trainers"
  },
  {
    "type": "subheading",
    "content": "Dig Cards"
  },
  {
    "type": "paragraph",
    "content": "Night March plays item-heavy, playing 4 Battle Compressor early to get Night Marchers and Supporter cards into the discard, the latter as targets of the 4 VS Seeker. Therefore the deck plays only 3 Professor Sycamore as the first copy found can be re-used. Sycamore gives a huge burst of draw, and in this deck the cost of discarding your hand is usually a positive. Supporter N can also help draw but its primary use is to hand disrupt in the lategame."
  },
  {
    "type": "paragraph",
    "content": "The deck also plays 4 Ultra Ball for hand dumping as Pokemon search, finding either attackers or Shaymin EX to continue drawing. the 4 Puzzle of Time work well with the 1 Teammates to create “Combo” turns where you can pull all the pieces for a play out of the discard or deck. The 3 Trainers' Mail round out the dig in the deck, allowing you that extra bit of reach at the end of your big draw actions."
  },
  {
    "type": "image",
    "src": "/decks/xy-sts/nightmarch/lysandre.jpg"
  },
  {
    "type": "subheading",
    "content": "Tech Cards"
  },
  {
    "type": "paragraph",
    "content": "2 Lysandre allow you to pull up smaller Pokemon EX for easy KOs, and to consistently take 2 Prize Cards a turn. 2 Hex Maniac helps against Greninja BREAK's “Giant Water Shuriken” and shutting of Trevenant's  “Forest's Curse”. Finding Hex Maniac is very important in those matchups and so there are 2 copies in the deck. Against opposing Giratina EX, Pokemon Ranger lets you ignore the effect of “Chaos Wheel” and attack as usual. Finally the AZ in the deck allows you to remove Shaymin EX from the board to deny your opponent cheap Prize Cards."
  },
  {
    "type": "paragraph",
    "content": "The 3 Dimension Valley allow Pumpkaboo to use “Night March”, and the 1 Special Charge lets your 4 Energy Cards stretch for a full six prizes every game. The 2 Fighting Fury Belt give an important +10 Damage boost, but also protect your Pokemon against spread or small “poke” attacks like Yveltal XYs “Oblivion Wing”. 1 Startling Megaphone can discard an opponent's Fighting Fury Belt or other annoying Tool Cards. 1 Target Whistle lets you take cheeky game ending KOs on your opponents discarded Pokemon EX, critically Shaymin EX in the mirror. Finally the 1 Escape Rope is generally useful for moving both your own and your opponent's Active Pokemon, in cases where you need to move your Active to attack or your opponent's to take 2 Prize Cards."
  },

  {
    "type": "heading",
    "content": "Energy"
  },
  {
    "type": "paragraph",
    "content": "As the only attack in the deck you will regularly use is “Night March” the deck only plays 4 Double Colorless Energy. At 2 Prizes per attack 4 is more than enough, but the deck can commit Puzzle of Time and Special Charge to recovering them in a pinch."
  }
]
